PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
/****************************************************************************
 *
 * Copyright (C) 2023 PX4 Development Team. All rights reserved.
 * Author: Peter van der Perk <peter.vanderperk@nxp.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *	notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *	notice, this list of conditions and the following disclaimer in
 *	the documentation and/or other materials provided with the
 *	distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *	used to endorse or promote products derived from this software
 *	without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/
#include <px4_platform_common/px4_config.h>
#include <px4_platform_common/micro_hal.h>
#include <px4_platform_common/log.h>
#include <imxrt_flexio.h>
#include <hardware/imxrt_flexio.h>
#include <imxrt_periphclks.h>
#include <px4_arch/dshot.h>
#include <px4_arch/io_timer.h>
#include <drivers/drv_dshot.h>
#include <drivers/drv_hrt.h>
#include <nuttx/irq.h>
#include <string.h>

#include "arm_internal.h"

#define FLEXIO_BASE			IMXRT_FLEXIO1_BASE
#define DSHOT_TIMERS			FLEXIO_SHIFTBUFNIS_COUNT
#define DSHOT_THROTTLE_POSITION		5u
#define DSHOT_TELEMETRY_POSITION	4u
#define NIBBLES_SIZE 			4u
#define DSHOT_NUMBER_OF_NIBBLES		3u

#if defined(IOMUX_PULL_UP_47K)
#define IOMUX_PULL_UP IOMUX_PULL_UP_47K
#endif

static const uint32_t gcr_decode[32] = {
	0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0,
	0x0, 0x9, 0xA, 0xB, 0x0, 0xD, 0xE, 0xF,
	0x0, 0x0, 0x2, 0x3, 0x0, 0x5, 0x6, 0x7,
	0x0, 0x0, 0x8, 0x1, 0x0, 0x4, 0xC, 0x0
};

typedef enum {
	DSHOT_START = 0,
	DSHOT_12BIT_FIFO,
	DSHOT_12BIT_TRANSFERRED,
	DSHOT_TRANSMIT_COMPLETE,
	BDSHOT_RECEIVE,
	BDSHOT_RECEIVE_COMPLETE,
} dshot_state;

typedef struct {
	uint8_t value;
	bool ready;
} edt_sample_t;

typedef struct dshot_channel_t {
	bool			init;
	bool			bdshot;
	dshot_state		state;
	uint32_t		data_seg1;
	uint32_t		irq_data;
	uint32_t		raw_response;
	hrt_abstime		tx_started;	// 0 while nothing is in flight
	int32_t			erpm;
	bool			erpm_valid;
	edt_sample_t		edt_temp;
	edt_sample_t		edt_volt;
	edt_sample_t		edt_curr;
	uint32_t		crc_error_cnt;
	uint32_t		frame_error_cnt;
	uint32_t		no_response_cnt;
	uint16_t		consecutive_successes;
	uint16_t		consecutive_failures;
	bool			online;
	uint32_t		bdshot_tcmp;
	uint32_t		bdshot_training_mask;
	uint8_t			bdshot_training_count;
	uint8_t			bdshot_training_success;
	bool			bdshot_training_done;
	int8_t			bdshot_tcmp_offset;
} dshot_channel_t;

#define BDSHOT_OFFLINE_COUNT 200
#define BDSHOT_RETRAIN_COUNT (2 * BDSHOT_OFFLINE_COUNT)

#define BDSHOT_TCMP_MIN_OFFSET -16
#define BDSHOT_TCMP_MAX_OFFSET 15
#define BDSHOT_TCMP_TO_MASK(x) ((x) - BDSHOT_TCMP_MIN_OFFSET)
#define BDSHOT_TRAINING_TRIES 200
#define BDSHOT_TRAINING_SUCCESS 198

static volatile dshot_channel_t dshot_inst[DSHOT_TIMERS] = {};

static uint32_t dshot_tcmp;
static unsigned dshot_speed;
static uint32_t bdshot_ready_mask;
static hrt_abstime _bdshot_busy_us;
static bool _edt_enabled = false;
static bool _dshot_armed = false;

static inline uint32_t flexio_getreg32(uint32_t offset)
{
	return getreg32(FLEXIO_BASE + offset);
}

static inline void flexio_modifyreg32(unsigned int offset,
				      uint32_t clearbits,
				      uint32_t setbits)
{
	modifyreg32(FLEXIO_BASE + offset, clearbits, setbits);
}

static inline void flexio_putreg32(uint32_t value, uint32_t offset)
{
	putreg32(value, FLEXIO_BASE + offset);
}

static inline void enable_shifter_status_interrupts(uint32_t mask)
{
	flexio_modifyreg32(IMXRT_FLEXIO_SHIFTSIEN_OFFSET, 0, mask);
}

static inline void disable_shifter_status_interrupts(uint32_t mask)
{
	flexio_modifyreg32(IMXRT_FLEXIO_SHIFTSIEN_OFFSET, mask, 0);
}

static inline uint32_t get_shifter_status_flags(void)
{
	return flexio_getreg32(IMXRT_FLEXIO_SHIFTSTAT_OFFSET);
}

static inline void clear_shifter_status_flags(uint32_t mask)
{
	flexio_putreg32(mask, IMXRT_FLEXIO_SHIFTSTAT_OFFSET);
}

static inline void enable_timer_status_interrupts(uint32_t mask)
{
	flexio_modifyreg32(IMXRT_FLEXIO_TIMIEN_OFFSET, 0, mask);
}

static inline void disable_timer_status_interrupts(uint32_t mask)
{
	flexio_modifyreg32(IMXRT_FLEXIO_TIMIEN_OFFSET, mask, 0);
}

static inline uint32_t get_timer_status_flags(void)
{
	return flexio_getreg32(IMXRT_FLEXIO_TIMSTAT_OFFSET);
}

static inline void clear_timer_status_flags(uint32_t mask)
{
	flexio_putreg32(mask, IMXRT_FLEXIO_TIMSTAT_OFFSET);
}

static inline void flexio_dshot_set_tcmp(uint32_t channel)
{
	dshot_inst[channel].bdshot_tcmp = 0x2900 | (((BOARD_FLEXIO_PREQ / (dshot_speed * 5 / 4) / 2) +
					  dshot_inst[channel].bdshot_tcmp_offset) & 0xFF);
}

// Shifter transmits on the FXIO pin. The timer runs in dual 8-bit baud mode and is triggered by the
// shifter status flag (active low = buffer full), so writing SHIFTBUF starts the frame.
static void flexio_dshot_output(uint32_t channel)
{
	uint32_t pin = timer_io_channels[channel].dshot.flexio_pin;
	bool inverted = dshot_inst[channel].bdshot;

	// TIMCFG and TIMCMP may only be written while the timer is disabled
	flexio_putreg32(0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
	flexio_putreg32(0, IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_SHIFTCFG_INSRC(FLEXIO_SHIFTER_INPUT_FROM_PIN) |
			FLEXIO_SHIFTCFG_PWIDTH(0) |
			FLEXIO_SHIFTCFG_SSTOP(FLEXIO_SHIFTER_STOP_BIT_LOW) |
			FLEXIO_SHIFTCFG_SSTART(FLEXIO_SHIFTER_START_BIT_DISABLED_LOAD_DATA_ON_ENABLE),
			IMXRT_FLEXIO_SHIFTCFG0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_SHIFTCTL_TIMSEL(channel) |
			FLEXIO_SHIFTCTL_TIMPOL(FLEXIO_SHIFTER_TIMER_POLARITY_ON_POSITIVE) |
			FLEXIO_SHIFTCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT) |
			FLEXIO_SHIFTCTL_PINSEL(pin) |
			FLEXIO_SHIFTCTL_PINPOL(inverted) |
			FLEXIO_SHIFTCTL_SMOD(FLEXIO_SHIFTER_MODE_TRANSMIT),
			IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_TIMCFG_TIMOUT(FLEXIO_TIMER_OUTPUT_ONE_NOT_AFFECTED_BY_RESET) |
			FLEXIO_TIMCFG_TIMDEC(FLEXIO_TIMER_DEC_SRC_ON_FLEX_IO_CLOCK_SHIFT_TIMER_OUTPUT) |
			FLEXIO_TIMCFG_TIMRST(FLEXIO_TIMER_RESET_NEVER) |
			FLEXIO_TIMCFG_TIMDIS(FLEXIO_TIMER_DISABLE_ON_TIMER_COMPARE) |
			FLEXIO_TIMCFG_TIMENA(FLEXIO_TIMER_ENABLE_ON_TRIGGER_HIGH) |
			FLEXIO_TIMCFG_TSTOP(FLEXIO_TIMER_STOP_BIT_DISABLED) |
			FLEXIO_TIMCFG_TSTART(FLEXIO_TIMER_START_BIT_DISABLED),
			IMXRT_FLEXIO_TIMCFG0_OFFSET + channel * 0x4);

	flexio_putreg32(dshot_tcmp, IMXRT_FLEXIO_TIMCMP0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_TIMCTL_TRGSEL((4 * channel) + 1) |
			FLEXIO_TIMCTL_TRGPOL(FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_LOW) |
			FLEXIO_TIMCTL_TRGSRC(FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL) |
			FLEXIO_TIMCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
			FLEXIO_TIMCTL_PINSEL(0) |
			FLEXIO_TIMCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
			FLEXIO_TIMCTL_TIMOD(FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT),
			IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
}

// Shifter receives from the FXIO pin. The timer is enabled by the first edge of the response and
// clocks 21 bits at the trained baud.
static void flexio_dshot_receive(uint32_t channel)
{
	uint32_t pin = timer_io_channels[channel].dshot.flexio_pin;

	flexio_putreg32(0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_SHIFTCFG_INSRC(FLEXIO_SHIFTER_INPUT_FROM_PIN) |
			FLEXIO_SHIFTCFG_PWIDTH(0) |
			FLEXIO_SHIFTCFG_SSTOP(FLEXIO_SHIFTER_STOP_BIT_DISABLE) |
			FLEXIO_SHIFTCFG_SSTART(FLEXIO_SHIFTER_START_BIT_DISABLED_LOAD_DATA_ON_SHIFT),
			IMXRT_FLEXIO_SHIFTCFG0_OFFSET + channel * 0x4);

	flexio_putreg32(FLEXIO_SHIFTCTL_TIMSEL(channel) |
			FLEXIO_SHIFTCTL_TIMPOL(FLEXIO_SHIFTER_TIMER_POLARITY_ON_POSITIVE) |
			FLEXIO_SHIFTCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
			FLEXIO_SHIFTCTL_PINSEL(pin) |
			FLEXIO_SHIFTCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
			FLEXIO_SHIFTCTL_SMOD(FLEXIO_SHIFTER_MODE_RECEIVE),
			IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);

	// The buffer-empty flag left by the transmit would otherwise read as a completed frame
	clear_shifter_status_flags(1u << channel);

	flexio_putreg32(FLEXIO_TIMCFG_TIMOUT(FLEXIO_TIMER_OUTPUT_ONE_AFFECTED_BY_RESET) |
			FLEXIO_TIMCFG_TIMDEC(FLEXIO_TIMER_DEC_SRC_ON_FLEX_IO_CLOCK_SHIFT_TIMER_OUTPUT) |
			FLEXIO_TIMCFG_TIMRST(FLEXIO_TIMER_RESET_ON_TIMER_PIN_RISING_EDGE) |
			FLEXIO_TIMCFG_TIMDIS(FLEXIO_TIMER_DISABLE_ON_TIMER_COMPARE) |
			FLEXIO_TIMCFG_TIMENA(FLEXIO_TIMER_ENABLE_ON_TRIGGER_BOTH_EDGE) |
			FLEXIO_TIMCFG_TSTOP(FLEXIO_TIMER_STOP_BIT_ENABLE_ON_TIMER_DISABLE) |
			FLEXIO_TIMCFG_TSTART(FLEXIO_TIMER_START_BIT_ENABLED),
			IMXRT_FLEXIO_TIMCFG0_OFFSET + channel * 0x4);

	flexio_putreg32(dshot_inst[channel].bdshot_tcmp, IMXRT_FLEXIO_TIMCMP0_OFFSET + channel * 0x4);

