PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
	flexio_putreg32(FLEXIO_TIMCTL_TRGSEL(2 * pin) |
			FLEXIO_TIMCTL_TRGPOL(FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_HIGH) |
			FLEXIO_TIMCTL_TRGSRC(FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL) |
			FLEXIO_TIMCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
			FLEXIO_TIMCTL_PINSEL(0) |
			FLEXIO_TIMCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
			FLEXIO_TIMCTL_TIMOD(FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT),
			IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
}

static void flexio_dshot_stop_channel(uint32_t channel)
{
	disable_shifter_status_interrupts(1u << channel);
	disable_timer_status_interrupts(1u << channel);
	flexio_putreg32(0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
	flexio_putreg32(0, IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);
}

// The shifter has loaded a full 21-bit frame into its buffer
static void bdshot_latch_response(uint32_t channel)
{
	disable_shifter_status_interrupts(1u << channel);
	dshot_inst[channel].raw_response = flexio_getreg32(IMXRT_FLEXIO_SHIFTBUFBIS0_OFFSET + channel * 0x4);
	dshot_inst[channel].state = BDSHOT_RECEIVE_COMPLETE;
}

static int flexio_irq_handler(int irq, void *context, void *arg)
{
	// A status flag whose interrupt is masked belongs to a phase that already completed
	uint32_t pending = get_shifter_status_flags() & flexio_getreg32(IMXRT_FLEXIO_SHIFTSIEN_OFFSET);

	for (uint32_t channel = 0; pending != 0 && channel < DSHOT_TIMERS; channel++) {
		uint32_t bit = 1u << channel;

		if ((pending & bit) == 0) {
			continue;
		}

		pending &= ~bit;
		volatile dshot_channel_t *ch = &dshot_inst[channel];

		if (ch->state == DSHOT_START) {
			// First 24 sub-bits are in the shifter; queue the rest. The second load must not interrupt.
			disable_shifter_status_interrupts(bit);
			ch->state = DSHOT_12BIT_FIFO;
			flexio_putreg32(ch->irq_data, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);

		} else if (ch->state == BDSHOT_RECEIVE) {
			bdshot_latch_response(channel);

		} else {
			disable_shifter_status_interrupts(bit);
		}
	}

	pending = get_timer_status_flags() & flexio_getreg32(IMXRT_FLEXIO_TIMIEN_OFFSET);

	for (uint32_t channel = 0; pending != 0 && channel < DSHOT_TIMERS; channel++) {
		uint32_t bit = 1u << channel;

		if ((pending & bit) == 0) {
			continue;
		}

		pending &= ~bit;
		clear_timer_status_flags(bit);
		volatile dshot_channel_t *ch = &dshot_inst[channel];

		if (ch->state == DSHOT_12BIT_FIFO) {
			ch->state = DSHOT_12BIT_TRANSFERRED;

		} else if (ch->state == DSHOT_12BIT_TRANSFERRED) {
			if (ch->bdshot) {
				// The frame is out. Only the shifter flag matters until the next transmit.
				disable_timer_status_interrupts(bit);
				ch->state = BDSHOT_RECEIVE;
				flexio_dshot_receive(channel);
				enable_shifter_status_interrupts(bit);

			} else {
				ch->state = DSHOT_TRANSMIT_COMPLETE;
			}
		}
	}

	return OK;
}

static bool decode_gcr_payload(uint32_t value, uint16_t *payload)
{
	uint32_t data;
	uint32_t csum_data;

	if ((value & 0x1) == 0) {
		return false;
	}

	value = value ^ (value >> 1);

	data = gcr_decode[value & 0x1fU];
	data |= gcr_decode[(value >> 5U) & 0x1fU] << 4U;
	data |= gcr_decode[(value >> 10U) & 0x1fU] << 8U;
	data |= gcr_decode[(value >> 15U) & 0x1fU] << 12U;

	csum_data = data;
	csum_data = csum_data ^ (csum_data >> 8U);
	csum_data = csum_data ^ (csum_data >> NIBBLES_SIZE);

	if ((csum_data & 0xFU) != 0xFU) {
		return false;
	}

	*payload = (data >> 4) & 0xFFF;
	return true;
}

static void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// MSB of the 9-bit mantissa clear means extended telemetry, not eRPM
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = !(mantissa & 0x0100);

	if (_edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF;

	} else {
		uint8_t exponent = ((payload >> 9) & 0x7);
		uint16_t period = (payload & 0x1FF);
		period = period << exponent;

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408 || period == 0) {
			packet->value = 0;

		} else {
			packet->value = (1000000U * 60U / 100U + period / 2U) / period;
		}
	}
}

static void bdshot_note_success(volatile dshot_channel_t *ch)
{
	ch->consecutive_failures = 0;

	if (ch->consecutive_successes < BDSHOT_OFFLINE_COUNT) {
		ch->consecutive_successes++;
	}

	if (ch->consecutive_successes >= BDSHOT_OFFLINE_COUNT) {
		ch->online = true;
	}
}

static void bdshot_restart_training(volatile dshot_channel_t *ch, uint32_t channel)
{
	ch->bdshot_training_done = false;
	ch->bdshot_training_mask = 0;
	ch->bdshot_training_count = 0;
	ch->bdshot_training_success = 0;
	ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;
	ch->consecutive_successes = 0;
	ch->consecutive_failures = 0;
	ch->online = false;
	flexio_dshot_set_tcmp(channel);
}

static void bdshot_note_failure(volatile dshot_channel_t *ch, uint32_t channel)
{
	if (!ch->bdshot_training_done) {
		return;
	}

	ch->consecutive_successes = 0;

	if (ch->consecutive_failures < BDSHOT_RETRAIN_COUNT) {
		ch->consecutive_failures++;
	}

	// The trained offset tracks the ESC oscillator, not the link, so a dropout keeps it. A baud
	// that stays wrong (ESC swapped, drift) never recovers on its own, hence the second period.
	if (ch->consecutive_failures >= BDSHOT_OFFLINE_COUNT) {
		ch->online = false;
	}

	if (ch->consecutive_failures >= BDSHOT_RETRAIN_COUNT) {
		bdshot_restart_training(ch, channel);
	}
}

// Sweep the RX baud offset and settle on the centre of the range that decodes cleanly
static void bdshot_train(volatile dshot_channel_t *ch, uint32_t channel, uint32_t value)
{
	uint16_t payload;

	if (decode_gcr_payload(value, &payload)) {
		ch->bdshot_training_success++;

	} else if ((value & 0x1) == 0) {
		// A framing error rules this offset out immediately
		ch->bdshot_training_count = BDSHOT_TRAINING_TRIES - 1;
	}

	ch->bdshot_training_count++;

	if (ch->bdshot_training_count < BDSHOT_TRAINING_TRIES) {
		return;
	}

	if (ch->bdshot_training_success >= BDSHOT_TRAINING_SUCCESS) {
		ch->bdshot_training_mask |= (1u << BDSHOT_TCMP_TO_MASK(ch->bdshot_tcmp_offset));
	}

	ch->bdshot_training_count = 0;
	ch->bdshot_training_success = 0;
	ch->bdshot_tcmp_offset++;

	if (ch->bdshot_tcmp_offset > BDSHOT_TCMP_MAX_OFFSET) {
		if (ch->bdshot_training_mask == 0) {
			ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;

		} else {
			int low  = __builtin_ctz(ch->bdshot_training_mask);
			int high = 31 - __builtin_clz(ch->bdshot_training_mask);
			ch->bdshot_tcmp_offset = ((low + high) / 2) + BDSHOT_TCMP_MIN_OFFSET;
			ch->bdshot_training_done = true;
			ch->consecutive_failures = 0;
			ch->consecutive_successes = BDSHOT_OFFLINE_COUNT;
			ch->online = true;
		}
	}

	flexio_dshot_set_tcmp(channel);
}

// Called once per transmit cycle for every capturing channel, response or not
static void bdshot_process_response(uint32_t channel)
{
	volatile dshot_channel_t *ch = &dshot_inst[channel];

	// DShot.cpp waits until every BDShot channel is ready, so a silent ESC must not stall the others
	bdshot_ready_mask |= (1u << channel);

	if (ch->state != BDSHOT_RECEIVE_COMPLETE) {
		ch->no_response_cnt++;
		bdshot_note_failure(ch, channel);
		return;
	}

	uint32_t value = ~ch->raw_response & 0xFFFFF;

	if (!ch->bdshot_training_done) {
		bdshot_train(ch, channel, value);
		return;
	}

	uint16_t payload = 0;

	if (!decode_gcr_payload(value, &payload)) {
		if ((value & 0x1) == 0) {
			ch->frame_error_cnt++;

		} else {
			ch->crc_error_cnt++;
		}

		bdshot_note_failure(ch, channel);
		return;
	}

	struct BDShotTelemetry packet = {};

	decode_dshot_telemetry(payload, &packet);

	switch (packet.type) {
	case DSHOT_EDT_ERPM:
		ch->erpm = packet.value;
		ch->erpm_valid = true;
		break;

	case DSHOT_EDT_TEMPERATURE:
		ch->edt_temp.value = packet.value;
		ch->edt_temp.ready = true;
		break;

	case DSHOT_EDT_VOLTAGE:
		ch->edt_volt.value = packet.value;
		ch->edt_volt.ready = true;
		break;

	case DSHOT_EDT_CURRENT:
		ch->edt_curr.value = packet.value;
		ch->edt_curr.ready = true;
		break;

	default:
		break;
	}

	bdshot_note_success(ch);
}

int up_dshot_init(uint32_t channel_mask, uint32_t bdshot_channel_mask, unsigned dshot_pwm_freq, bool edt_enable)
{
	imxrt_clockall_flexio1();

	// Reset the peripheral before the driver state so a stale IRQ has nothing to service
	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0, FLEXIO_CTRL_SWRST_MASK);
	flexio_putreg32(0, IMXRT_FLEXIO_CTRL_OFFSET);

	memset((void *)dshot_inst, 0, sizeof(dshot_inst));
	bdshot_ready_mask = 0;
	_dshot_armed = false;
	_edt_enabled = edt_enable;
	dshot_speed = dshot_pwm_freq;
	dshot_tcmp = 0x2F00 | (((BOARD_FLEXIO_PREQ / (dshot_pwm_freq * 3) / 2) - 1) & 0xFF);

	// 16-bit frame, ESC turnaround, 21-bit GCR response at 5/4 rate, margin for IRQ latency
	_bdshot_busy_us = (16u * 1000000u) / dshot_pwm_freq + 30u + (21u * 4u * 1000000u) / (5u * dshot_pwm_freq) + 50u;

	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET,
			   (FLEXIO_CTRL_DOZEN_MASK |
			    FLEXIO_CTRL_DBGE_MASK |
			    FLEXIO_CTRL_FASTACC_MASK |
			    FLEXIO_CTRL_FLEXEN_MASK),
			   (FLEXIO_CTRL_DBGE(1) |
			    FLEXIO_CTRL_FASTACC(1) |
			    FLEXIO_CTRL_FLEXEN(0)));

	irq_attach(IMXRT_IRQ_FLEXIO1, flexio_irq_handler, 0);
	up_enable_irq(IMXRT_IRQ_FLEXIO1);

	uint32_t dshot_mask = 0;

