PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
	for (unsigned channel = 0; channel < MAX_TIMER_IO_CHANNELS; channel++) {
		uint32_t bit = 1u << channel;

		if (((channel_mask | bdshot_channel_mask) & bit) == 0) {
			continue;
		}

		if (channel >= DSHOT_TIMERS || timer_io_channels[channel].dshot.pinmux == 0) {
			// Cannot capture, so it must never hold up DShot.cpp's all-channels-ready wait
			bdshot_ready_mask |= bit & bdshot_channel_mask;
			PX4_WARN("no FlexIO DShot on output %u", channel);
			continue;
		}

		volatile dshot_channel_t *ch = &dshot_inst[channel];

		imxrt_config_gpio(timer_io_channels[channel].dshot.pinmux | IOMUX_PULL_UP);

		ch->bdshot = (bdshot_channel_mask & bit) != 0;

		if (ch->bdshot) {
			ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;
			flexio_dshot_set_tcmp(channel);
		}

		flexio_dshot_output(channel);
		ch->init = true;
		dshot_mask |= bit;
	}

	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0, FLEXIO_CTRL_FLEXEN_MASK);

	return dshot_mask;
}

uint16_t up_bdshot_get_ready_mask(void)
{
	return (uint16_t)bdshot_ready_mask;
}

int up_bdshot_num_errors(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].crc_error_cnt + dshot_inst[channel].frame_error_cnt + dshot_inst[channel].no_response_cnt;
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	// Channels without capture keep their permanent ready bit, so return before clearing it
	if (channel >= DSHOT_TIMERS || !dshot_inst[channel].bdshot) {
		return -1;
	}

	int status = -1;

	if (dshot_inst[channel].erpm_valid) {
		*erpm = dshot_inst[channel].erpm;
		status = 0;
	}

	bdshot_ready_mask &= ~(1u << channel);
	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	if (channel >= DSHOT_TIMERS) {
		return -1;
	}

	volatile edt_sample_t *sample = NULL;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		sample = &dshot_inst[channel].edt_temp;
		break;

	case DSHOT_EDT_VOLTAGE:
		sample = &dshot_inst[channel].edt_volt;
		break;

	case DSHOT_EDT_CURRENT:
		sample = &dshot_inst[channel].edt_curr;
		break;

	default:
		return -1;
	}

	if (!sample->ready) {
		return -1;
	}

	*value = sample->value;
	sample->ready = false;
	return 0;
}

int up_bdshot_channel_capture_supported(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].init && dshot_inst[channel].bdshot;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].online;
}

void up_bdshot_status(void)
{
	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		volatile dshot_channel_t *ch = &dshot_inst[channel];

		if (!ch->init) {
			continue;
		}

		PX4_INFO("Channel %i %s Last erpm %li value", channel, ch->online ? "online" : "offline", ch->erpm);

		if (_edt_enabled) {
			PX4_INFO("EDT Temp %u C  Volt %.2f V  Curr %u A",
				 ch->edt_temp.value, (double)ch->edt_volt.value * 0.25, ch->edt_curr.value);
		}

		PX4_INFO("BDSHOT Training done: %s TCMP offset: %d", ch->bdshot_training_done ? "YES" : "NO",
			 ch->bdshot_tcmp_offset);
		PX4_INFO("CRC errors Frame error No response");
		PX4_INFO("%10lu %11lu %11lu", ch->crc_error_cnt, ch->frame_error_cnt, ch->no_response_cnt);
	}
}

void up_dshot_trigger(void)
{
	if (!_dshot_armed) {
		return;
	}

	uint32_t tx_mask = 0;

	// Interrupts off: the IRQ must not see DSHOT_START on a shifter still in receive mode, and a frame
	// completing right now must be latched here rather than lost to the reconfiguration below.
	irqstate_t irqflags = px4_enter_critical_section();
	hrt_abstime now = hrt_absolute_time();

	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		volatile dshot_channel_t *ch = &dshot_inst[channel];
		uint32_t bit = 1u << channel;

		if (!ch->init || ch->data_seg1 == 0) {
			continue;
		}

		if (ch->bdshot) {
			if (ch->state == BDSHOT_RECEIVE && (get_shifter_status_flags() & bit)) {
				bdshot_latch_response(channel);
			}

			// The ESC may still be driving the line
			if (ch->state != BDSHOT_RECEIVE_COMPLETE && (now - ch->tx_started) < _bdshot_busy_us) {
				continue;
			}

			if (ch->tx_started != 0) {
				bdshot_process_response(channel);
			}

			flexio_dshot_output(channel);
		}

		ch->state = DSHOT_START;
		ch->tx_started = now;
		clear_shifter_status_flags(bit);
		clear_timer_status_flags(bit);
		tx_mask |= bit;
	}

	px4_leave_critical_section(irqflags);

	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (tx_mask & (1u << channel)) {
			flexio_putreg32(dshot_inst[channel].data_seg1, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);
		}
	}

	enable_shifter_status_interrupts(tx_mask);
	enable_timer_status_interrupts(tx_mask);
}

// Each DShot bit becomes three shifter bits: 110 for a one, 100 for a zero
static uint64_t dshot_expand_data(uint16_t packet)
{
	unsigned int mask;
	unsigned int index = 0;
	uint64_t expanded = 0x0;

	for (mask = 0x8000; mask != 0; mask >>= 1) {
		if (packet & mask) {
			expanded = expanded | ((uint64_t)0x3 << index);

		} else {
			expanded = expanded | ((uint64_t)0x1 << index);
		}

		index = index + 3;
	}

	return expanded;
}

// bits  1-11  throttle (0-47 are commands, 48-2047 give 2000 steps of throttle)
// bit   12    telemetry request
// bits  13-16 XOR checksum, inverted for bidirectional
void dshot_motor_data_set(uint8_t channel, uint16_t throttle, bool telemetry)
{
	if (channel >= DSHOT_TIMERS || !dshot_inst[channel].init) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= throttle << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = dshot_inst[channel].bdshot ? ~packet : packet;
	csum_data >>= NIBBLES_SIZE;

	for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F);
		csum_data >>= NIBBLES_SIZE;
	}

	packet |= (checksum & 0x0F);

	uint64_t dshot_expanded = dshot_expand_data(packet);

	dshot_inst[channel].data_seg1 = (uint32_t)(dshot_expanded & 0xFFFFFF);
	dshot_inst[channel].irq_data = (uint32_t)(dshot_expanded >> 24);
}

int up_dshot_arm(bool armed)
{
	irqstate_t irqflags = px4_enter_critical_section();
	_dshot_armed = armed;

	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (!dshot_inst[channel].init) {
			continue;
		}

		if (armed) {
			// Nothing is in flight; the first trigger must not count a missing response
			dshot_inst[channel].tx_started = 0;
			flexio_dshot_output(channel);

		} else {
			flexio_dshot_stop_channel(channel);
		}
	}

	px4_leave_critical_section(irqflags);
	return 0;
}
